package com.xindu.talkfx_new.base;

/**
 * Created by LeeBoo on 2018/3/15.
 */

public enum NetResponseCode {

    登录成功("000203", "登录成功"),
    请先获取验证码("000001", "请先获取验证码"),
    验证码已发送("000002", "验证码已发送，请注意查收"),
    请输入正确的手机号码("000003", "请输入正确的手机号码"),
    请输入正确的邮箱号码("000004", "请输入正确的邮箱号码"),
    该手机号码已存在("000100", "该手机号码已存在"),
    该邮箱号码已存在("000101", "该邮箱号码已存在"),
    邮箱模版异常("000102", "邮箱模版异常"),
    邮件发送失败("000103", "邮件发送失败"),
    邮件发送成功("000104", "邮件发送成功"),
    邮件激活账号失败("000105", "邮件激活账号失败"),
    该手机号未注册("000106", "该手机号未注册，请先注册"),
    您的操作太过频繁("000107", "您的操作太过频繁"),
    验证码错误("000108", "验证码错误，请重新输入"),
    连接已经过期("000109", "连接已经过期"),
    密码不为空("000110", "密码不能为空"),
    没有找到此账号("000111", "没有找到此账号"),
    无效的数据("000201", "无效的数据"),
    操作失败("000202", "操作失败"),
    操作成功("000203", "操作成功"),
    退出登录失败("000204", "退出登录失败"),
    发布成功("000205", "发布成功！"),
    登录失败("010001", "登录失败！"),
    用户名或密码错误("010002", "用户名或密码错误"),
    账号被锁定("010003", "账号被锁定"),
    注册信息不完整("010004", "注册信息不完整"),
    每人只有一次改名机会("010005", "每人只有一次改名机会"),
    用户名已存在("010006", "用户名已存在"),
    密码不能为空("010007", "密码不能为空"),
    未进行实名认证("010008", "未进行实名认证"),
    昵称中含有敏感字或疑似内容("010009", "昵称中含有敏感字或疑似内容，请您修改后再试"),
    专栏内容不能为空("020001", "专栏内容不能为空"),
    专栏类型不能为空("020002", "专栏类型不能为空"),
    专栏标题不能为空("020003", "专栏标题不能为空"),
    专栏货币对不能为空("020004", "专栏货币对不能为空"),
    专栏观点不能为空("020005", "专栏观点不能为空"),
    标题中含有敏感字或疑似内容("020006", "标题中含有敏感字或疑似内容，请您修改后再试"),
    正文中含有敏感字或疑似内容("020007", "正文中含有敏感字或疑似内容，请您修改后再试"),
    观点中含有敏感字或疑似内容("020008", "观点中含有敏感字或疑似内容，请您修改后再试"),
    评论内容不能为空("040001", "评论内容不能为空"),
    评论中含有敏感字或疑似内容("040002", "评论中含有敏感字或疑似内容，请您修改后再试"),
    不能进行重复操作("020101", "不能进行重复操作"),
    自己不能关注自己("030001", "自己不能关注自己"),
    //    不能进行重复操作("030002", "不能进行重复操作"),
    //    不能进行重复操作("030003", "不能进行重复操作"),
    成就类型不能为空("050001", "成就类型不能为空"),
    交易商不能为空("050002", "交易商不能为空"),
    认证信息不能为空("050003", "认证信息不能为空"),
    公函内容不为空("050004", "公函内容不能为空"),
    请上传公函扫描件("050005", "请上传公函扫描件，仅支持图片和PDF格式"),
    上传的文件超过5MB("050006", "上传的文件超过5MB，请压缩图片后再试"),
    公函内容不能为空("050007", "公函内容不能为空"),
    姓名不能为空("050008", "姓名不能为空"),
    身份证号码不能为空("050009", "身份证号码不能为空"),
    你已经认证成功("0500010", "你已经认证成功"),
    您的认证仍在审核中("0500011", "您的认证仍在审核中，请耐心等待，或联系客服"),
    实名认证信息不能为空("0500012", "实名认证信息不能为空"),
    实名认证信息有误("0500013", "实名认证信息有误"),
    重复认证("0500014", "重复认证"),
    未完成实名认证("0500015", "未完成实名认证"),
    实名认证失败("0500016", "实名认证失败，请重新认证");


    private String value;
    private String code;

    NetResponseCode(String code, String value) {
        this.code = code;
        this.value = value;
    }

    public static String getName(String code) {
        for (NetResponseCode c : NetResponseCode.values()) {
            if (c.getCode().equals(code)) {
                return c.value;
            }
        }
        return null;
    }

    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }
}
